In [64]:
import pandas as pd

In [65]:
# Question 1
list = [2,4,5,6,9]

ser = pd.Series(list)
print(ser)

ser_odd = pd.Series(list[1::2])
print(ser_odd)

new_ser = pd.Series(map(lambda x: int(x/2),list))
print(new_ser)

0    2
1    4
2    5
3    6
4    9
dtype: int64
0    4
1    6
dtype: int64
0    1
1    2
2    2
3    3
4    4
dtype: int64

In [66]:
# Question 2

dates = pd.date_range("1st May, 2021", periods=12, freq='D')
dates_series = pd.Series(dates)
print(dates_series)

0    2021-05-01
1    2021-05-02
2    2021-05-03
3    2021-05-04
4    2021-05-05
5    2021-05-06
6    2021-05-07
7    2021-05-08
8    2021-05-09
9    2021-05-10
10   2021-05-11
11   2021-05-12
dtype: datetime64[ns]

In [67]:
# Question 3

dictionary = {'name': ['Vinay', 'Kushal', 'Aman'],
 'age' : [22, 25, 24],
 'occ' : ['engineer', 'doctor', 'accountant']}

df = pd.DataFrame(dictionary)
print(df)

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

In [68]:
# Question 4

lists = [[2, 'Vishal', 22],
 [1, 'Kushal', 25],
 [1, 'Aman', 24]]

df = pd.DataFrame(lists)
print(df)

df.to_csv(r"lists.csv", index=False)

df2 = pd.read_csv("lists.csv")
print(df2)

df2.index = [5,4,7]
print(df2)

   0       1   2
0  2  Vishal  22
1  1  Kushal  25
2  1    Aman  24
   0       1   2
0  2  Vishal  22
1  1  Kushal  25
2  1    Aman  24
   0       1   2
5  2  Vishal  22
4  1  Kushal  25
7  1    Aman  24

In [69]:
# Question 5

df2.sort_index(inplace=True)
print(df2)

   0       1   2
4  1  Kushal  25
5  2  Vishal  22
7  1    Aman  24

In [70]:
# Question 6

print(df.columns)
df.columns = ["0","1","2"]
df4 = df.sort_values(by=["0","2"]) # sorting by using multiple columns...
print(df4)

RangeIndex(start=0, stop=3, step=1)
   0       1   2
2  1    Aman  24
1  1  Kushal  25
0  2  Vishal  22

In [71]:
# Question 7

print(df2)
df2.reset_index(inplace=True, drop=True)
print(df2)

   0       1   2
4  1  Kushal  25
5  2  Vishal  22
7  1    Aman  24
   0       1   2
0  1  Kushal  25
1  2  Vishal  22
2  1    Aman  24

In [72]:
# Question 8
print(df)
df_2rows = df.loc[0:1]
print(df_2rows)

   0       1   2
0  2  Vishal  22
1  1  Kushal  25
2  1    Aman  24
   0       1   2
0  2  Vishal  22
1  1  Kushal  25

In [73]:
# Question 9

print(df)
df_condition = df.loc[df['2']>23]
print(df_condition)

   0       1   2
0  2  Vishal  22
1  1  Kushal  25
2  1    Aman  24
   0       1   2
1  1  Kushal  25
2  1    Aman  24

In [74]:
# Question 10

dict = {
    "name":[ 'Vinay', 'Kushal', 'Aman', 'Rahul', 'Ramesh'],
    "occ":['engineer','doctor','engineer','doctor','doctor'],
    "salary":[60000,70000,50000,60000,65000],
    "experience": [10,None,7,None,9]
}

dataFrame = pd.DataFrame(dict)
print(dataFrame)


new_df = dataFrame.groupby('occ')
print("Average salary per occupation is:\n ", new_df['salary'].mean())

# Filling empty data with zeros...
dataFrame.fillna(0,inplace=True)
print(dataFrame)

     name       occ  salary  experience
0   Vinay  engineer   60000        10.0
1  Kushal    doctor   70000         NaN
2    Aman  engineer   50000         7.0
3   Rahul    doctor   60000         NaN
4  Ramesh    doctor   65000         9.0
Average salary per occupation is:
  occ
doctor      65000.0
engineer    55000.0
Name: salary, dtype: float64
     name       occ  salary  experience
0   Vinay  engineer   60000        10.0
1  Kushal    doctor   70000         0.0
2    Aman  engineer   50000         7.0
3   Rahul    doctor   60000         0.0
4  Ramesh    doctor   65000         9.0